"""
Необходимо написать программу, которая будет считывать со стандартного
ввода название города и время и выводить информацию в формате
“Current location is [Location] and time is [Time]”
Пример 1
    Входные данные
        Moscow 12:00
    Выходные данные
        Current location is Moscow and time is 12:00
"""

city = input()
time = input()
print("Current location is", city, "and time is", time)