"""
Необходимо написать программу, которая будет считывать со стандартного ввода
имя пользователя и выводить приветствие вида “Hello, [Username]
Пример 1
    Входные данные
        Ivan
    Выходные данные
        Hello, Ivan
"""

name = input()
print("Hello,", name)